==================
single metadata
==================

2026-01-05T18:11Z create lore "Entry with metadata"
  type: "fact"

---

(source_file
  (entry
    (data_entry
      (timestamp)
      (data_directive)
      (identifier)
      (title)
      (metadata
        (key)
        (value
          (quoted_value))))))

==================
multiple metadata
==================

2026-01-05T18:11Z create lore "Entry with multiple metadata"
  type: "fact"
  subject: ^acme

---

(source_file
  (entry
    (data_entry
      (timestamp)
      (data_directive)
      (identifier)
      (title)
      (metadata
        (key)
        (value
          (quoted_value)))
      (metadata
        (key)
        (value
          (link))))))

==================
metadata with quoted value
==================

2026-01-05T18:11Z create opinion "Opinion with source" #work
  confidence: "high"
  source: "Technical documentation"

---

(source_file
  (entry
    (data_entry
      (timestamp)
      (data_directive)
      (identifier)
      (title)
      (tag)
      (metadata
        (key)
        (value
          (quoted_value)))
      (metadata
        (key)
        (value
          (quoted_value))))))

==================
metadata with reference value
==================

2026-01-05T18:11Z create lore "Entry with reference"
  type: "fact"
  subject: ^acme
  related: ^other-entry

---

(source_file
  (entry
    (data_entry
      (timestamp)
      (data_directive)
      (identifier)
      (title)
      (metadata
        (key)
        (value
          (quoted_value)))
      (metadata
        (key)
        (value
          (link)))
      (metadata
        (key)
        (value
          (link))))))

==================
metadata with date range
==================

2026-01-05T18:11Z create lore "Entry with date range"
  type: "fact"
  subject: ^acme
  date: 2022 ~ 2024

---

(source_file
  (entry
    (data_entry
      (timestamp)
      (data_directive)
      (identifier)
      (title)
      (metadata
        (key)
        (value
          (quoted_value)))
      (metadata
        (key)
        (value
          (link)))
      (metadata
        (key)
        (value
          (date_range))))))

==================
metadata with hyphenated key
==================

2026-01-05T18:11Z create reference "Reference entry"
  ref-type: "article"
  status: "read"

---

(source_file
  (entry
    (data_entry
      (timestamp)
      (data_directive)
      (identifier)
      (title)
      (metadata
        (key)
        (value
          (quoted_value)))
      (metadata
        (key)
        (value
          (quoted_value))))))
